In [1]:
import pandas as pd

In [2]:
df_geral = pd.read_csv("./raw-files/df_paises_nacoes.csv", index_col=0)
df_geral.rename(columns={'Countries': 'country_name'}, inplace=True)
df_geral.head()

  country_name
0    Guatemala
1  New Zealand
2       Norway
3      Burundi
4      Algeria

In [3]:
len(df_geral)

225

In [4]:
df_vizinhos = pd.read_csv("./output-files/Neighbors.csv", index_col=0)
df_vizinhos.head()

   country_name  n_neightbours
0        France              8
1         Spain              5
2          Oman              3
3  Saudi Arabia              7
4         China             16

In [5]:
len(df_vizinhos)

164

In [8]:
df = pd.merge(
    df_geral, df_vizinhos,
    how="left",
    on=['country_name']
)

In [9]:
df

     country_name  n_neightbours
0       Guatemala            4.0
1     New Zealand            NaN
2          Norway            3.0
3         Burundi            3.0
4         Algeria            7.0
..            ...            ...
220       Bermuda            NaN
221       Eritrea            3.0
222  Cook Islands            NaN
223       Uruguay            2.0
224       Jamaica            NaN

[225 rows x 2 columns]

In [10]:
df.to_excel("./Arquivo.xlsx")